# -*- coding: utf-8 -*-
"""ДЗ_4.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/16RxfM4lSGLiEqUhs3nTGRI9akX1k0HOT

Задание 1.

Печатные газеты использовали свой формат дат для каждого выпуска. Для каждой газеты из списка напишите формат указанной даты для перевода в объект datetime:

*   The Moscow Times - Wednesday, October 2, 2002
*   The Guardian - Friday, 11.10.13
*   Daily News - Thursday, 18 August 1977

Пример работы программы:

Программа должна выводить на экран объекты типа datetime, соответствующие датам в условии задачи.
"""

from datetime import datetime

# The Moscow Times - Wednesday, October 2, 2002
date_moscow = datetime.strptime("Wednesday, October 2, 2002", "%A, %B %d, %Y")

# The Guardian - Friday, 11.10.13
date_guardian = datetime.strptime("Friday, 11.10.13", "%A, %d.%m.%y")

# Daily News - Thursday, 18 August 1977
date_daily = datetime.strptime("Thursday, 18 August 1977", "%A, %d %B %Y")

print(date_moscow)
print(date_guardian)
print(date_daily)

"""Задание 2 (не обязательное)

Напишите функцию date_range, которая возвращает список дат за период от start_date до end_date. Даты должны вводиться в формате YYYY-MM-DD.

В случае неверного формата или при start_date > end_date должен возвращаться пустой список.

Примеры работы программы:
date_range(‘2022-01-01’, ‘2022-01-03’)

[‘2022-01-01’, ‘2022-01-02’, ‘2022-01-03’]
"""

from datetime import datetime, timedelta

def date_range(start_date, end_date):
    try:
        start = datetime.strptime(start_date, "%Y-%m-%d")
        end = datetime.strptime(end_date, "%Y-%m-%d")
    except ValueError:
        return []

    if start > end:
        return []

    result = []
    current = start
    while current <= end:
        result.append(current.strftime("%Y-%m-%d"))
        current += timedelta(days=1)

    return result

print(date_range("2022-01-01", "2022-01-03"))
print(date_range("2022-01-03", "2022-01-01"))
print(date_range("2022-02-30", "2022-02-31"))