# -*- coding: utf-8 -*-
"""ДЗ 1.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1G17H9aH35eU8OeZLhaXaPq7-SX8MJtAF

Задание 1. Напишите код на Python в среде Jupyter Notebook или Google Colab для решения
следующей задачи.
Дана переменная, в которой хранится слово из латинских букв. Напишите код, который
выводит на экран:
– среднюю букву, если число букв в слове нечётное;
– две средних буквы, если число букв чётное.
Пример работы программы:
1. word =’test' Результат: es
2. word = 'testing' Результат: t
"""

word = input("Введите слово: ")
length = len(word)
start = (length - 1) // 2
end = length // 2 + 1

print(word[start:end])

"""Задание 2.
Напишите код на Python в среде Jupyter Notebook или Google Colab для решения
следующей задачи.
Вы делаете MVP (минимально жизнеспособный продукт) dating-сервиса. У вас есть
список юношей и девушек.
Выдвигаем гипотезу: лучшие рекомендации получатся, если просто отсортировать
имена по алфавиту и познакомить людей с одинаковыми индексами после сортировки.
Но вы не будете никого знакомить, если кто-то может остаться без пары.

Примеры работы программы:
boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
Результат:
Идеальные пары:
Alex и Emma
Arthur и Kate
John и Kira
Peter и Liza
Richard и Trisha
boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
Результат: Внимание, кто-то может остаться без пары!
"""

boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
if len(boys) != len(girls):
    print("Внимание, кто-то может остаться без пары!")
else:
    print("Идеальные пары:")
    boys.sort()
    girls.sort()

    for i in range(len(boys)):
        print(boys[i], "и", girls[i])

boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
if len(boys) != len(girls):
    print("Внимание, кто-то может остаться без пары!")
else:
    print("Идеальные пары:")
    boys.sort()
    girls.sort()

    for i in range(len(boys)):
        print(boys[i], "и", girls[i])