# -*- coding: utf-8 -*-
"""ДЗ 2.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1vdB9vlQG8ez0ZmT_O_cjidENDxZTjGGp

Задание 1.

Напишите код на Python для решения следующей задачи.
Реализуйте функцию sum_distance(from, to), которая суммирует все числа от
значения from до величины to включительно.
Примечание. Если пользователь задаст первое число, которое окажется
больше второго, просто поменяйте их местами.
"""

def sum_distance(from_value, to_value):
    if from_value > to_value:
        from_value, to_value = to_value, from_value

    total = 0
    for number in range(from_value, to_value + 1):
        total += number

    return total


print(sum_distance(1, 5))
print(sum_distance(10, 3))

"""Задание 2.

Напишите код на Python для решения следующей задачи.
Реализуйте функцию trim_and_repeat(), которая принимает три параметра:

● строку;

● offset — число символов, на которое нужно обрезать строку слева;

● repetitions — сколько раз нужно повторить строку перед возвратом
получившейся строки.
Число символов для среза по умолчанию равно 0, а количество повторений — 1.

Функция должна возвращать полученную строку.
"""

def trim_and_repeat(text, offset=0, repetitions=1):
    trimmed = text[offset:]

    result = trimmed * repetitions

    return result


print(trim_and_repeat("Hello", 2, 3))
print(trim_and_repeat("Python"))
print(trim_and_repeat("World", 1))