# -*- coding: utf-8 -*-
"""ДЗ_3.ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1U8ZgQATjc8SC-oYUHzJBgh6PaG8H_18E

Задание 1.

Переведите содержимое файла purchase_log.txt в словарь purchases вида:
{'1840e0b9d4': 'Продукты',...}

Пример работы программы при выводе первых двух элементов словаря
purchases:

1840e0b9d4 ‘Продукты‘

4e4f90fcfb ‘Электроника‘
"""

import json

purchases = {}

with open('/content/purchase_log.txt', 'r', encoding='utf8') as f:

    next(f)

    for line in f:
        data = json.loads(line.strip())
        purchases[data['user_id']] = data['category']

i = 0
for user, cat in purchases.items():
    print(user, cat)
    i += 1
    if i == 2:
        break

"""Задание 2.

Для каждого user_id в файле visit_log.csv определите третий столбец с
категорией покупки. Если покупка была, сам файл visit_log.csv изменять не
надо.
Запишите в файл funnel.csv визиты из файла visit_log.csv, в которых были
покупки с указанием категории.
Учтите условия для данных:

● содержимое purchase_log.txt помещается в оперативную память
компьютера;

● содержимое visit_log.csv — нет, используйте только построчную
обработку этого файла.

Примеры работы программы при выводе первых трёх строк файла funnel.csv:

user_id,source,category

1840e0b9d4,other,Продукты

4e4f90fcfb,context,Электроника
"""

# создаём файл funnel.csv
with open('/content/visit_log.csv', 'r', encoding='utf-8') as fin, \
     open('/content/funnel.csv', 'w', encoding='utf-8-sig') as fout:

    fout.write('user_id,source,category\n')
    next(fin)

    for line in fin:
        line = line.strip()
        user_id, source = line.split(',')

        if user_id in purchases:
            category = purchases[user_id]
            fout.write(f'{user_id},{source},{category}\n')

print("Файл funnel.csv успешно создан!")

print("Первые 3 строки funnel.csv:")
with open('/content/funnel.csv', 'r', encoding='utf-8-sig') as f:
    for i in range(3):
        print(f.readline().strip())
